function solve(input) {
    let num1 = Number(input.shift()); // прочитаме първото число
    let num2 = Number(input.shift()); // прочитаме второто число
    let operation = input.shift(); // прочитаме оператора

    let output = ""; // инициализираме променлива, в която ще запишем изхода
    let result = 0; // инициализираме променлива, в която ще запишем резултата от операцията на числата
    switch (operation) {
        case '+': // ако оператора е събиране
            result = num1 + num2; // намираме сумата
            output = `${num1} + ${num2} = ${result}`; // записваме изхода в променливата
            break;
        case '-': // ако оператора е изваждане
            result = num1 - num2; // намираме разликата
            output = `${num1} - ${num2} = ${result}`; // записваме изхода в променливата
            break;
        case '*': // ако оператора е умножение
            result = num1 * num2; // умножаваме числата
            output = `${num1} * ${num2} = ${result}`; // записваме изхода в променливата
            break;
        case '/': // ако оператора е делене
            if (num2 === 0) { // ако второто число е 0
                output = `Cannot divide ${num1} by zero`; // записваме изхода за делене на 0 в променливата
            } else { // в противен случай
                result = num1 / num2; // делим числата
                output = `${num1} / ${num2} = ${result.toFixed(2)}`; // записваме изхода в променливата
            }
            break;
        case '%': // ако е модулно делене
            if (num2 === 0) { // ако второто число е 0
                output = `Cannot divide ${num1} by zero`; // записваме изхода за делене на 0 в променливата
            } else { // в противен случай
                result = num1 % num2;// намираме остатъка от делението
                output = `${num1} % ${num2} = ${result}`; // записваме изхода в променливата
            }
            break;
    }
    // ако оператора е събиране, изваждане или умножение
    if (operation === '+' || operation === '-' || operation === '*') {
        if (result % 2 === 0) { // ако резултата е четно число
            output = output + " - even"; // към променливата със изхода добавяме текст за четен резултат
        } else { // ако резултата е нечетно число
            output = output + " - odd"; // към променливата със изхода добавяме текст за нечетен резултат
        }
    }

    console.log(output); // принтираме променливата със изхода
}